app/controllers/documents_controller.rb

SELECT `documents`.* FROM `documents`
---
  def index
    @documents = Document.all

INSERT INTO `documents` (`code`, `created_at`, `date`, `document_type_id`, `person_id`, `updated_at`) VALUES ('dcfvghj', '2014-07-07 22:51:27', '2012-03-09', 1, 1, '2014-07-07 22:51:27')
---
  def create
    @document = Document.new(document_params)

    respond_to do |format|
      if @document.save

SELECT  `documents`.* FROM `documents`  WHERE `documents`.`id` = 1 LIMIT 1
---
    def set_document
      @document = Document.find(params[:id])